*&---------------------------------------------------------------------*
*& Include          YCL105_001_PBO
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Module STATUS_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE status_0100 OUTPUT.
  SET PF-STATUS 'S100'.
  SET TITLEBAR  'T100'.
ENDMODULE.
*&---------------------------------------------------------------------*
*& Module CREATE_ALV_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE create_alv_0100 OUTPUT.

  IF gr_con IS BOUND. "if gr_con is initial

  ELSE.
    PERFORM create_object_0100.      "Container, ALV 참조변수 객체 생성
    PERFORM set_alv_layout_0100.     "ALV Layout 설정
    PERFORM set_alv_fieldcat_0100.   "ALV Field Catalog 설정
    PERFORM display_alv_0100.
  ENDIF.

ENDMODULE.
